*** 打印字符串中的某个字符
#+BEGIN_SRC C
  #include <stdio.h>
  #include <string.h>
  int main()
  {
    char* s1="welcome";
    char* s2="hello";
    char* s3="world";

    char* p[]={s1,s2,s3};
    int i=0;
    printf("%c\n",*(p[0]+0));
    printf("%c %c \n",*s1,s1[0]);
    printf("%c %c\n",*p[0],p[0][0]);
    return 0;

  }

#+END_SRC

#+RESULTS:
| w |   |
| w | w |
| w | w |

*** 打印命令行参数
#+BEGIN_SRC C : 
  #include <stdio.h>
  int main(int argc,const char* argv[])
  {

    int i=0;
    for(i=0;i<argc;i++)
      {
        printf("%s\n",argv[i]);

      }
    return 0;
  }
#+END_SRC

#+RESULTS:
| hello |

*** 函数指针一
#+BEGIN_SRC  C
  # include <stdio.h>
  # include <string.h>

  #define N 100

  char * mystrcpy(char * dest, char *src);
  int main(int argc, const char *argv[])
  {
      char s1[N];
      char s2[] = "welcome";

      char *  (* pfunc)(char *, char *);

      pfunc = mystrcpy;// pfunc = mystrcat

      (*pfunc)(s1, s2);//pfunc(s1,s2)


      puts(s1);
      puts(s2);
    
      return 0;
  }

  char * mystrcpy(char * dest, char *src) {//char * dest = s1;  char * src = s2;
      char * p = dest;
      while (*src != '\0') {
          *dest = *src;
          src++;
          dest++;
      }
      *dest = '\0';

      return p;
  }

#+END_SRC

#+RESULTS:
| welcome |
| welcome |
*** 函数指针二
#+BEGIN_SRC C

  #include <stdio.h>
  #include <stdlib.h>

  int get_result(int n) {
    return n;
  }

  int get_sum(int n) {
    int sum=0, i = 1;

    while (i <= n) {
      sum += i;
      i++;
    }

    return sum;
  }

  int test(int n, int (*pFunc)(int)) {//int (*pFunc)(int) = get_sum
    return (*pFunc)(n+1);
  }

  int main(int argc, const char *argv[])//   ./a.out   100
  {
    int ret, n = 100;

    int (*p)(int);

    p = get_sum;

    //ret = get_sum(n);
    ret = (*p)(n);
    //ret = p(n);
    printf("sum=%d\n", ret);

    //ret = test(100, get_sum);
    ret = test(100, get_result);
    printf("ret=%d\n", ret);

    return 0;
  }
#+END_SRC

#+RESULTS:
| sum=5050 |
| ret=101  |

*** 函数指针三
#+BEGIN_SRC C :tangle p.c
  #include <stdio.h>
  #include <stdlib.h>

  #define N 100

  static int compar_int(const void *, const void *);

  int main(int argc, const char *argv[])
  {
    int a[] = {9, 45, 1, 6, 9, 2}, i;

    qsort(a, sizeof(a)/sizeof(int), sizeof(int), compar_int);

    for (i = 0; i < sizeof(a)/sizeof(int); i++) {
      printf("%d\n", a[i]);
    }

    return 0;
  }

   static int compar_int(const void *p1, const void *p2)
         {
          return *((const int *)p1) - *((const int *)p2);

         }


#+END_SRC

#+RESULTS:
|  1 |
|  2 |
|  6 |
|  9 |
|  9 |
| 45 |

*** 指针一
#+BEGIN_SRC C
  #include <stdio.h>

  int main(int argc, const char *argv[])
  {
    int arr[] = {1, 6, 3, 9, 20}, i;
    int * p;

    p = arr;

    for (i = 0; i < sizeof(arr)/sizeof(int); i++) {
      printf("%d %d %d %d\n", arr[i], *(arr+i), *(p+i),p[i]); 
    }

    i = 0;
    while (i < sizeof(arr)/sizeof(int)) {
      printf("%d\n", *p);
      p++;
      i++;
    }

    //    p--;
    //    printf("\n%d\n", *p);

    //    p = arr;
    //    printf("\n%d\n", p[4]);

    printf("\n%d %d\n", p[-1], *(p-1));


    return 0;
  }
#+END_SRC

#+RESULTS:
|  1 |  1 |  1 |  1 |
|  6 |  6 |  6 |  6 |
|  3 |  3 |  3 |  3 |
|  9 |  9 |  9 |  9 |
| 20 | 20 | 20 | 20 |
|  1 |    |    |    |
|  6 |    |    |    |
|  3 |    |    |    |
|  9 |    |    |    |
| 20 |    |    |    |
|    |    |    |    |
| 20 | 20 |    |    |

*** 指针二
#+BEGIN_SRC C
  # include <stdio.h>
  # include <string.h>
  #define N 100
  int main(int argc, const char *argv[])
  {
    char * s1 = "welcome";
    char * s2 = "to";
    char a[] = "hello";
    char b[] = "word";

    char *  p[4]; //char *  q[]  = {s1, s2, a, b};
    p[0] = s1;
    p[1] = s2;
    p[2] = a;
    p[3] = b;


    printf("%c %c\n", *s1, s1[0]);
    printf("%c %c\n", *p[0], p[0][0]);


    printf("%c %c %c \n", *(*(p+1)+1),*(p[1]+1),*(s2+1) );

    printf("%d %d %d\n", sizeof(p[0]), sizeof(char *), sizeof(p));
    printf("%p %p\n", &p[0],&p[1]);
    printf("%p %p\n", p, p+1);


    printf("%d %d \n", sizeof(double), sizeof(double *));


    return 0;
  }

#+END_SRC

#+RESULTS:
|          w |          w |    |
|          w |          w |    |
|          o |          o |  o |
|          4 |          4 | 16 |
| 0xbff54318 | 0xbff5431c |    |
| 0xbff54318 | 0xbff5431c |    |
|          8 |          4 |    |

*** 指针三
#+BEGIN_SRC C
  #include <stdio.h>
  int main(int argc, const char *  argv[])
  {
    int m = 10;

    int * p;
    int ** q;
    int *** r;

    p = &m;
    q = &p;
    r = &q;

   // printf("%d %d %d %d\n",m, *p, **q, ***r);

    char * s[3] = {"beijing", "shenzhen", "shanghai"};
    char ** sp;

    sp = s;//s[0]+1
    //sp = &s[0];
    int a[][10]={{1,2,3,4,5,6,7,8,9,0},{11,12,13,14,15,16,17,18,19,20}};
    int i = 0,(*pp)[10];
    while (i < sizeof(s)/sizeof(char *)) {

      printf("%s, %s,%s,%s\n", s[i], *(sp+i),sp[i],*(s+i));

      i++;
    }


      printf("%c, %c,%c,%c,%c,%c\n", s[0][1], *(*s+1),sp[0][1],*(*sp+1),*(s[0]+1),*s[1]);
      printf("%c, %c,%c,%c,%c,%c\n", s[1][1], *(*(s+1)+1),sp[1][1],*(*(sp+1)+1),*(s[1]+1),*s[1]);

       //s++;
      //s[0]++;
      //sp++;
      //sp[0]++;
      //a++;
      pp = a;
      pp+=1;
      printf("%d   \n",**pp);



    return 0;
  }

#+END_SRC

#+RESULTS:
| beijing,  | beijing,beijing,beijing    |
| shenzhen, | shenzhen,shenzhen,shenzhen |
| shanghai, | shanghai,shanghai,shanghai |
| e,        | e,e,e,e,s                  |
| h,        | h,h,h,h,s                  |
| 11        |                            |

*** union
#+BEGIN_SRC C
  #include <stdio.h>

  union sem {
    char a;
    short b;
    int c;
  }u1;

  int main(int argc, const char *argv[])
  {
    void * p;
    p =  &u1;
    u1.c = 0x12345678;  //
    
    printf("%#x, %#x, %#x\n", u1.a, u1.b, u1.c);
    printf("%p %p %p %p\n", &u1, &u1.a, &u1.b, &u1.c);

    printf("%#x\n", *(char *)p);
    printf("%#x\n", *((char *)p+1));
    printf("%#x\n", *((char *)p+2));
    printf("%#x\n", *((char *)p+3));

    char * q;
    int i;

    //    q = &u1;
    return 0;
  }

#+END_SRC

#+RESULTS:
|     0x78, |   0x5678, | 0x12345678 |           |
| 0x804a01c | 0x804a01c |  0x804a01c | 0x804a01c |
|      0x78 |           |            |           |
|      0x56 |           |            |           |
|      0x34 |           |            |           |
|      0x12 |           |            | 
       
*** 结构体 
#+BEGIN_SRC C
  #include <stdio.h>
  #include <string.h>
  #define N 50

  typedef struct Student {
    long no;
    char name[N];
    struct {
      int year;
      int month;
      int day;
    }birth;
  }Stu, * Stup;


  int main(int argc, const char *argv[])
  {
    Stu s1, s2 = {2, "Tom", {1999, 9, 9}};
    Stu * p;//struct Student * p;

    p = &s1;

    s1.no = 1;
    strcpy(s1.name, "jerry");
    s1.birth.year = 1999;
    s1.birth.month = 9;
    s1.birth.day = 9;


    printf("%ld %s %d-%02d-%02d\n", s1.no, s1.name, 
           s1.birth.year, s1.birth.month, s1.birth.day);
    return 0;
  }


#+END_SRC

#+RESULTS:
: 1 jerry 1999-09-09

